import { IPetMap } from '../interfaces/pet.interface';
import { EPetWiKiNavigation } from '../enums/pet.enum';

export const PETS_MAP: IPetMap = {
  teddyDog: {
    [EPetWiKiNavigation.OVERVIEW]:
      '<p>小巧、毛茸茸、迷人的泰迪狗让人一见钟情。</p><p>这些玩具小狗快乐、顽皮、可爱。</p><p>他们喜欢用可爱的行动，给主人留下美好回忆，让他们的人类家庭幸福。</p><p>泰迪狗热衷于各类家庭活动，非常喜欢游戏、拥抱和训练。</p><p>泰迪熊狗，也被称为 Zuchon 或 Shichon，是一种设计师犬种。</p><p>通常是“西施犬”与“比熊犬”的杂交，或者是西施犬与马耳他犬杂交的后代。</p><p>它们体型娇小，毛茸茸的，脸型圆润可爱，外观上很像泰迪熊。</p>',
    [EPetWiKiNavigation.CHARACTERISTICS]:
      '<p>泰迪狗非常友善——它们对孩子、其他宠物和陌生人都很友善。</p><p>泰迪狗不会偏爱，他是一种魅力十足的狗，对每个人都一视同仁，是儿童和成人最美妙的伴侣宠物。</p><p>可爱又温暖，是一种优秀的治疗犬。</p><p>他的适应性很强，城市还是农村，或者郊区，泰迪狗都能很快适应环境。</p><p>泰迪狗适合所有家庭、单身人士或年老的主人。</p><p>性格和蔼可亲，能与猫等其他宠物和谐相处。</p><p>幼犬容意训练，他们喜欢学习技巧，热爱表演，参与娱乐活动。</p>',
    [EPetWiKiNavigation.APPEARANCE]:
      '<p>美丽的泰迪熊眼睛，圆圆的脸，还有毛茸茸的外套。</p><p>可爱是泰迪狗外表的代名词。</p><p>体型娇小，看起来很友好，没有攻击性，愿意交朋友。</p><p>泰迪狗是两种或多种不同犬种的混合品种，所以他们具有父母一些特征。</p><p>泰迪狗是宠物狗品种，继承了亲本品种的小体型。</p><p>虽然每只狗的体型可能略有不同，对于成年泰迪狗平均高度通常为 22 - 31 cm，体重为 2.72 - 6.5 kg。</p><p>全身覆盖着柔软蓬松的皮毛，圆圆的脸蛋，圆圆的眼睛闪闪发光。</p><p>娇小的鼻子，可爱的垂耳，还有一条蓬松的短尾巴卷在背上。</p><p>从外表上看，他们就像一只泰迪熊。</p><p>泰迪狗防过敏的毛皮柔软蓬松，有多种华丽的颜色，最常见的是棕色、白色、黑色、灰色和黄色。</p>',
    [EPetWiKiNavigation.PHOTOS]: [''],
    [EPetWiKiNavigation.TEMPERAMENT]:
      '<p>作为两种不同狗的混种，泰迪幼犬继承了父母所提供的优秀品质。</p><p>友善、深情、冷静。</p><p>与其他毛皮宝宝交朋友以及拥抱主人是他们最喜欢的活动之一。</p><p>喜欢玩捉迷藏游戏、解决谜题、追逐咀嚼玩具。</p><p>还喜欢自由漫步、游泳和抓取。</p><p>因为他们是注重家庭的狗，所以非常喜欢拥抱和宠爱。</p><p>对于孩子来说，泰迪狗是最好的毛茸朋友。</p><p>他们有耐心、温柔，可以和小孩子一起玩耍，活泼（或者调皮），可以让大一点的孩子开心。</p><p>训练泰迪狗也是一种有趣且有益的经历。</p><p>这些小狗喜欢学习课程来获得关注，热衷于给主人留下深刻的印象。</p><p>他们喜欢尝试新的技巧，自豪地炫耀他们所学到的东西。</p><p>当游戏时间结束时，泰迪狗会甜蜜、深情地等待拥抱。</p>',
    [EPetWiKiNavigation.CARE]:
      '<p>清洁护理： 泰迪熊的美容费用不高。</p><p>他们只需要每月洗澡一次，每周梳理一次，就可以保持皮毛干净、无缠结、有光泽。</p><p>建议检查和清洁他们的耳朵和眼睛，定期刷牙，根据需要修剪指甲。</p><p>运动关怀： 泰迪狗是一种顽皮、喜欢拥抱的小狗。</p><p>他们喜欢参加所有家庭活动，无论是户外运动游戏还是在家放松游戏。</p><p>泰迪狗喜欢在房子里闲逛，就像他们喜欢在空旷的场地上追球一样。</p><p>每天几次快走和一些室内活跃的玩耍时间就足以让泰迪熊保持快乐和健康。</p><p>健康： 泰迪狗是一种健康的品种，不像其他小型犬种那样容易出现许多健康问题。</p><p>有时，他们可能会出现牙齿问题、眼睛问题或耳朵感染等疾病。</p><p>建议保持泰迪狗的均衡饮食和优质狗粮，并提供适当的锻炼方案。</p><p>过度运动、过度喂养、粗暴玩耍和处理不当可能会导致严重的健康问题，应该避免。</p><p>寿命： 泰迪狗的寿命在12至18年之间。</p><p>泰迪狗在温暖有爱的环境，得到营养丰富的饮食和日常锻炼活动后，其预期寿命可以超过18岁。</p><p>训练： 泰迪狗是非常聪明的狗。</p><p>当他们得到适当的激励时，可很容易地接受培训。</p><p>为了让泰迪狗保持专注和渴望学习，最好保持训练课程简短且易于互动，使用积极的强化方法。</p><p>训练泰迪幼犬时，欢呼赞美和美味零食效果最佳。</p><p>一旦他们对所教的内容产生兴趣，他们就会变成听话、随和的学生。</p><p>泰迪幼犬的社交和牵引训练应该逐渐进行，最好每天几分钟。</p><p>尽管他们性格外向、善于交际、友善，但最好尽早让他们熟悉新的环境，应对各种事件。</p>',
    [EPetWiKiNavigation.HISTORY]:
      '<p>泰迪狗是在 2000 年前后的美国，特意将西施犬和卷毛比熊犬杂交而成的。</p><p>泰迪狗饲养员希望将这两个品种混合在一起，以便培育出体型与西施犬一样大小的可爱幼犬。</p><p>他们拥有了西施犬和比熊犬的适应性。</p><p>饲养员发现 Shichon（又名泰迪熊）越来越受欢迎，因为它们的皮毛过敏较低，对所有类型的家庭都很友好。</p><p>尽管泰迪狗的明确起源尚不清楚，但我们可以回顾一下西施犬、马耳他犬和卷毛比雄犬品种的历史，以更好地了解这个设计杂交品种。</p><p>西施犬是泰迪狗的亲本品种之一，据说是最古老的犬种之一，也是皇帝的最爱。</p><p>中国对西施犬品种的文化记录可以追溯到六世纪，它们是为了生活在宫殿中并取悦皇帝而饲养的。</p><p>马耳他犬是犬类贵族中的一员。</p><p>几个世纪以来，作为皇室和贵族的狗，马耳他狗一直在绘画、陶瓷和文学中出现。</p><p>马耳他幼犬是最有礼貌的小型宠物之一，它们听话、精力充沛，也很快乐、顽皮。</p><p>几个世纪以前，卷毛比雄犬在法国和西班牙非常受欢迎，出现在两国的皇室肖像中。</p><p>在 16 世纪，旅行的水手将卷毛比雄犬从特内里费岛（Tenerife）带到了欧洲。</p><p>比熊犬一出现，就以其深情甜美的天性和惹人喜爱的漂亮外表迅速俘获了宫女们的芳心，很快成为宫廷宠儿。</p><p>泰迪狗是送给世界各地爱狗人士的礼物。</p>',
  },
};
